Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Creates a new Object.
ja: 新しいObjectを作成します。

source: Creates a new directory, including its parent directories if necessary.
ja: 必要に応じて親ディレクトリも含めて、新しいディレクトリを作成します。

source: Creates a pop-up window with WS_BORDER, WS_POPUP, and WS_SYSMENU styles.
ja: WS_BORDER,WS_POPUP,WS_SYSMENUスタイルのポップアップウィンドウを作成します。

source: Creates a pop-up window.
ja: ポップアップウィンドウを作成します。

source: Creates a popup menu that is displayed when the user presses a hotkey.
ja: ユーザーがホットキーを押したときに表示されるポップアップメニューを作成します。

source: Creates a popup window.
ja: ポップアップウィンドウを作成します。

source: Creates a push button that posts a WM_COMMAND message to the owner window when the user selects the button.
ja: ユーザーがボタンを選択すると、オーナー・ウィンドウにWM_COMMANDメッセージをポストするプッシュ・ボタンを作成します。

source: Creates a push button with a heavy black border.
ja: 黒い太い縁取りのある押しボタンを作成します。

source: Creates a rectangle in which other controls can be grouped.
ja: 他のコントロールをグループ化できる矩形を作成する。

source: Creates a registry key without writing a value.
ja: 値を書き込まずにレジストリキーを作成します。

source: Creates a see-through rectangular hole inside Notepad (or any other window).
ja: メモ帳（または他のウィンドウ）の内側にシースルーの長方形の穴を作成します。

source: Creates a self-signed digital certificate named "AutoHotkey" and signs each UIA.exe file.
ja: AutoHotkey」という名前の自己署名デジタル証明書を作成し、各UIA.exeファイルに署名します。

source: Creates a shortcut (.lnk) file.
ja: ショートカット（.lnk）ファイルを作成します。

source: Creates a simple image viewer.
ja: シンプルなイメージビューアを作成します。

source: Creates a simple input-box that asks for the first and last name.
ja: 姓と名を入力するシンプルな入力ボックスを作成します。

source: Creates a simple text editor with menu bar.
ja: メニューバーを持つシンプルなテキストエディタを作成します。

source: Creates a tab control with multiple tabs, each containing different controls to interact with.
ja: 複数のタブを持つタブコントロールを作成し、それぞれのタブには異なるコントロールが配置され、対話することができます。

source: Creates a triangle with apex pointing down.
ja: 頂点を下に向けた三角形を作る。

source: Creates a window that has a border of a style typically used with dialog boxes.
ja: ダイアログボックスで一般的に使用されるスタイルの境界線を持つウィンドウを作成する。

source: Creates a window that has a horizontal scroll bar.
ja: 水平スクロールバーを持つウィンドウを作成します。

source: Creates a window that has a maximize button.
ja: 最大化ボタンを持つウィンドウを作成します。

source: Creates a window that has a minimize button.
ja: 最小化ボタンを持つウィンドウを作成します。

source: Creates a window that has a sizing border.
ja: サイズの枠線を持つウィンドウを作成します。

source: Creates a window that has a thin-line border.
ja: 細い線の境界線を持つウィンドウを作成します。

source: Creates a window that has a title bar.
ja: タイトルバーを持つウィンドウを作成します。

source: Creates a window that has a vertical scroll bar.
ja: 垂直スクロールバーを持つウィンドウを作成します。

source: Creates a window that has a window menu on its title bar.
ja: タイトルバーにウィンドウメニューを持つウィンドウを作成します。

source: Creates a window that is initially disabled.
ja: 初期状態では無効になっているウィンドウを作成する。

source: Creates a window that is initially maximized.
ja: 初期状態で最大化されたウィンドウを作成します。

source: Creates a window that is initially minimized.
ja: 初期状態では最小化されているウィンドウを作成します。

source: Creates a window that is initially visible.
ja: 初期状態で表示されているウィンドウを作成する。

source: Creates an Array from a sequence of parameter values.
ja: 一連のパラメータ値からArrayを作成します。

source: Creates an Object from a list of property name and value pairs.
ja: プロパティ名と値のペアのリストから、Objectを作成します。

source: Creates an Error object.
ja: Error オブジェクトを作成します。

source: Creates an On-screen display (OSD) via transparent window.
ja: 透明なウィンドウでオンスクリーンディスプレイ(OSD)を作成します。

source: Creates an always-on-top window anywhere on the screen.
ja: 画面上の任意の場所に常時表示されるウィンドウを作成します。

source: Creates an ellipse instead of a rectangle.
ja: 矩形の代わりに楕円を作成する。

source: Creates an empty registry key.
ja: 空のレジストリキーを作成します。

source: Creates an infinite loop, but it will be terminated after the 25th iteration.
ja: 無限ループを作成しますが、25回目の反復で終了します。

source: Creates an object containing everything on the clipboard (such as pictures and formatting).
ja: クリップボード上のすべてのもの（画像や書式など）を含むオブジェクトを作成します。

source: Creates an object of the given class (Fruit in this case).
ja: 指定されたクラス（この場合は Fruit）のオブジェクトを作成します。

source: Creates an object which can be used to collect or intercept keyboard input.
ja: キーボード入力の収集や傍受に使用できるオブジェクトを作成します。

source: Creates an overlapped window with the WS_OVERLAPPED, WS_CAPTION, WS_SYSMENU, WS_THICKFRAME, WS_MINIMIZEBOX, and WS_MAXIMIZEBOX styles.
ja: WS_OVERLAPPED、WS_CAPTION、WS_SYSMENU、WS_THICKFRAME、WS_MINIMIZEBOX、WS_MAXIMIZEBOXスタイルのオーバーラップ ウィンドウを作成します。

source: Creates an overlapped window.
ja: オーバーラップしたウィンドウを作成する。

source: Creates and returns a new Gui object.
ja: 新しいGuiオブジェクトを作成し、返します。

source: Creates context-sensitive hotkeys and hotstrings.
ja: 文脈依存のホットキーと ホットストリングを作成します。

source: Creates two hotkeys and one hotstring which only work when Notepad is active, and one hotkey which works for any window except Notepad.
ja: メモ帳がアクティブなときにのみ機能する2つのホットキーと1つのホットストリング、およびメモ帳以外のウィンドウで機能する1つのホットキーを作成します。

source: Creates, modifies, enables, or disables a hotstring while the script is running.
ja: スクリプトの実行中に、ホットストリングを作成、変更、有効化、または無効化します。

source: Creates, modifies, enables, or disables a hotkey while the script is running.
ja: スクリプトの実行中にホットキーを作成、変更、有効化、または無効化します。

source: Creating Objects
ja: オブジェクトの作成

source: Creating a Base Object
ja: ベースオブジェクトの作成

source: Creating a Keyboard Macro or Mouse Macro
ja: キーボードマクロまたはマウスマクロの作成

source: Creating a Keyboard Macro or Mouse Macro | AutoHotkey v2
ja: キーボードマクロまたはマウスマクロの作成｜AutoHotkey v2

source: Creating hotkeys via the double-colon syntax performs better than using the Hotkey function because the hotkeys can all be enabled as a batch when the script starts (rather than one by one).
ja: ダブルコロン構文でホットキーを作成すると、スクリプトの起動時に一括してホットキーを有効にできるため、ホットキー機能を使用するよりもパフォーマンスが向上します（1つずつ有効にするのではありません）。

source: Creating this hotkey would exceed the limit of 32762 hotkeys per script (however, each hotkey can have an unlimited number of variants, and there is no limit to the number of hotstrings).
ja: このホットキーを作成すると、スクリプトごとに32762個のホットキーという制限を超えてしまいます（ただし、各ホットキーには無制限のバリエーションがあり、ホットストリングの数には制限がありません）。

source: Criteria
ja: 基準

source: Criteria beyond the first should be separated from the previous with exactly one space or tab (any other spaces or tabs are treated as a literal part of the previous criterion).
ja: 1つ目以降の基準は、正確に1つのスペースまたはタブで区切らなければならない（それ以外のスペースまたはタブは、前の基準のリテラル部分として扱われる）。

source: Criteria can be specified within the script by using the #Requires directive, either as a requirement (if supported by the target AutoHotkey version), or appended to the directive as a comment beginning with "prefer" and ending with a full stop or line ending.
ja: スクリプト内で#Requiresディレクティブを使用することで、条件を指定することができます（対象のAutoHotkeyバージョンでサポートされている場合）。

source: Critical - Syntax & Usage | AutoHotkey v2
ja: Critical - 構文と使用法｜AutoHotkey v2

source: Critical threads are uninterruptible; for details, see Threads.
ja: クリティカルなスレッドは中断されない。詳細は「スレッド」を参照。

source: CtrlC := Chr(3) ; Store the character for Ctrl-C in the CtrlC var.
ja: CtrlC := Chr(3) ; CtrlCの文字をCtrlC varに格納します。

source: Curly braces {} as destination keys.
ja: 中括弧{}をデスティネーション・キーとする。

source: Current 1-digit day of the week (1-7).
ja: 現在の1桁の曜日（1～7）。

source: Current 2-digit day of the month (01-31).
ja: 現在の月の2桁の曜日（01-31）。

source: Current 2-digit hour (00-23) in 24-hour time (for example, 17 is 5pm).
ja: 24時間制の現在の2桁の時（00～23）（例：17は午後5時）。

source: Current 2-digit minute (00-59).
ja: 現在の2桁の分（00-59）。

source: Current 2-digit month (01-12).
ja: 現在の2桁の月（01-12）。

source: Current 2-digit second (00-59).
ja: 現在の2桁の秒（00-59）。

source: Current 3-digit millisecond (000-999).
ja: 現在の3桁のミリ秒（000-999）。

source: Current 4-digit year (e.g. 2004).
ja: 現在の4桁の年（例：2004年）。

source: Current day of the week's abbreviation in the current user's language, e.g. Sun
ja: 現在のユーザーの言語での曜日略号 例：Sun

source: Current day of the week's full name in the current user's language, e.g. Sunday
ja: 現在のユーザーの言語での曜日フルネーム 例：日曜日

source: Current day of the year (1-366).
ja: 現在の曜日（1～366）。

source: Current month's abbreviation in the current user's language, e.g. Jul
ja: 現在のユーザーの言語での現在の月の略称 例：Jul

source: Current month's full name in the current user's language, e.g. July
ja: 現在のユーザーの言語での現在の月のフルネーム 例：7月

source: Current position of the file pointer.
ja: ファイルポインタの現在位置。

source: Current user installation does not require admin rights, as long as the user has write access to the chosen directory.
ja: 現在のユーザーによるインストールでは、ユーザーが選択したディレクトリへの書き込み権限を持っている限り、管理者権限は必要ありません。

source: Current versions of the language do not permit creating new variables dynamically.
ja: 現在のバージョンの言語では、新しい変数を動的に作成することはできません。

source: Current year and week number (e.g. 200453) according to ISO 8601.
ja: ISO 8601に従った現在の年号と週番号（例：200453）。

source: CurrentFileName := readContent(FileArray[1]) ; Read the first file only (in case there's more than one).
ja: CurrentFileName := readContent(FileArray[1]) ; 最初のファイルだけ読み込む（複数ある場合）。

source: Currently Float keys are still converted to strings.
ja: 現在、Floatキーは文字列に変換されたままです。

source: Currently all AutoHotkey v2 executables are built for Unicode, so this function always accepts a Unicode character code and returns a Unicode (UTF-16) string.
ja: 現在、すべてのAutoHotkey v2実行ファイルはUnicode用にビルドされているため、この関数は常にUnicode文字コードを受け取り、Unicode（UTF-16）文字列を返します。

source: Currently brackets are required when accessing elements; i.e. a.1 refers to a property and a[1] refers to an element.
ja: 現在、要素にアクセスする際には括弧が必要です。例えば、a.1はプロパティを指し、a[1]は要素を指します。

source: Currently it is little more than a menu containing the following items, but it might be expanded to provide controls for active scripts, or other convenient functions.
ja: 現在は、以下の項目を含むメニューに過ぎないが、アクティブなスクリプトのコントロールや、その他の便利な機能を提供するために拡張されるかもしれない。

source: Currently it is necessary to specify "actual size" when setting the icon to preserve transparency.
ja: 現在、アイコンの透明度を保つために、設定時に「実寸」を指定する必要があります。

source: Currently only IPv4 is supported.
ja: 現在のところ、IPv4のみがサポートされている。

source: Currently only the following value types are supported:
ja: 現在、以下の値の種類にのみ対応しています：

source: Currently only the following value types are supported: REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD, and REG_BINARY.
ja: 現在、以下の値の種類にのみ対応しています：REG_SZ、REG_EXPAND_SZ、REG_MULTI_SZ、REG_DWORD、REG_BINARY。

source: Currently the Stack property cannot exceed 2047 characters.
ja: 現在、Stackプロパティは2047文字を超えることはできません。

source: Currently the keyword can be followed by a comma, but it is not required as this is not a parameter.
ja: 現在、キーワードの後にカンマを付けることができますが、これはパラメータではないので必須ではありません。

source: Currently this excludes a few directives (which are neither commands nor functions).
ja: 現在、一部のディレクティブ（コマンドでも関数でもない）を除いています。

source: Currently, second must always contain a variable name in the second case; arbitrary expressions are not supported.
ja: 現在、secondの場合は必ず変数名を含む必要があり、任意の式はサポートされていません。

source: Currently, AutoHotkey v2 caches a pure number only when assigning a pure number to a variable, not when reading it.
ja: 現在、AutoHotkey v2では、純粋な数値を変数に代入するときのみキャッシュし、読み込むときはキャッシュしません。

source: Currently, all shortcut keys are created as Ctrl+Alt shortcuts.
ja: 現在、すべてのショートカットキーはCtrl+Alt ショートカットとして作成されています。

source: Currently, all special Alt-tab actions must be assigned directly to a hotkey as in the examples above (i.e. they cannot be used as though they were functions).
ja: 現在、Alt-tabの特殊な動作は、上記の例のようにホットキーに直接割り当てる必要があります（つまり、機能のように使用することはできません）。

source: Currently, the compression state of files cannot be changed with this function.
ja: 現在、この機能でファイルの圧縮状態を変更することはできません。

source: Currently, the only such feature is that any backslash in a pattern that is followed by a letter that has no special meaning causes an exception to be thrown.
ja: 現在のところ、このような機能は、パターン中のバックスラッシュの後に特別な意味を持たない文字が続くと例外がスローされるということだけである。

source: Cursor Control Keys
ja: カーソル制御キー

source: Custom Combinations
ja: カスタムコンビネーション

source: Custom Combinations and Down/Up Hotkeys
ja: カスタムコンビネーションとダウン/アップホットキー

source: Custom Objects
ja: カスタムオブジェクト

source: Custom alt-tab actions can also be created via hotkeys.
ja: また、alt-tabのカスタムアクションをホットキーで作成することも可能です。

source: Custom's N and Normal events were replaced with GuiControl.OnNotify() and GuiControl.OnCommand(), which can be used with any control.
ja: CustomのNイベントとNormalイベントは、GuiControl.OnNotify()とGuiControl.OnCommand()に置き換えられ、あらゆるコントロールで使用できるようになりました。

source: Custom's N and Normal events were replaced with GuiCtrl.OnNotify() and GuiCtrl.OnCommand(), which can be used with any control.
ja: CustomのNイベントとNormalイベントは、GuiCtrl.OnNotify()とGuiCtrl.OnCommand()に置き換えられ、あらゆるコントロールで使用できるようになりました。

source: D = Include directories (folders).
ja: D = インクルードディレクトリ（フォルダ）。

source: DPI Scaling
ja: DPIスケーリング

source: DPI Scaling | AutoHotkey v2
ja: DPIスケーリング｜AutoHotkey v2

source: DPI scaling is a function performed either by the operating system or by the application, to increase the visual size of content proportionate to the "dots per inch" setting of the display.
ja: DPIスケーリングは、オペレーティングシステムまたはアプリケーションによって実行される機能で、ディスプレイの「ドット/インチ」設定に比例してコンテンツの視覚的サイズを拡大する。

source: DPI scaling is enabled by default for GUIs
ja: GUIではDPIスケーリングがデフォルトで有効になる

source: DPI scaling only applies to the Gui and GuiControl methods/properties, so coordinates coming directly from other sources such as ControlGetPos or WinGetPos will not work.
ja: DPIスケーリングはGuiとGuiControlのメソッド/プロパティにのみ適用されるので、ControlGetPosやWinGetPosのような他のソースから直接得られる座標は動作しません。

source: Dark
ja: ダーク

source: Data "flows" from or to the Connector and is altered as it flows through each Subunit, such as to adjust volume or suppress (mute) all sound.
ja: データはコネクタから、またはコネクタへ「流れ」、各サブユニットを流れる際に、音量を調整したり、すべての音を抑制（ミュート）するなど、変更される。

source: Data type options:
ja: データ型オプション：

source: Date Formats (case sensitive)
ja: 日付の形式（大文字と小文字を区別します）

source: Date Formats (case-sensitive)
ja: 日付の形式（大文字・小文字は区別されます）

source: Date and Time:
ja: 日時

source: Date and Time: A_YYYY, A_MM, A_DD, A_Hour, A_Min, A_Sec, (...more...)
ja: 日時：A_YYYY、A_MM、A_DD、A_Hour、A_Min、A_Sec、(...もっと...)

source: Date options.
ja: 日付の選択肢。

source: Date-time stamps in the YYYYMMDDHH24MISS format.
ja: YYYYMMDDHH24MISS形式の日付・時間スタンプです。

source: Date-time values can be compared, added to, or subtracted from via DateAdd and DateDiff.
ja: DateAdd、DateDiffにより、日付時刻の値を比較、加算、減算することができます。

source: DateAdd - Syntax & Usage | AutoHotkey v2
ja: DateAdd - 構文と使用法｜AutoHotkey v2

source: DateDiff - Syntax & Usage | AutoHotkey v2
ja: DateDiff - 構文と使用法｜AutoHotkey v2

source: DateTime Control Styles
ja: DateTimeコントロールのスタイル

source: Day of the month with leading zero (01 – 31)
ja: 日付（先頭のゼロあり）（01～31）

source: Day of the month without leading zero (1 – 31)
ja: 日付（先頭のゼロなし）（1～31）

source: Day of the week (1 – 7).
ja: 1週間のうち何日目かを表す日（1～7）です。

source: Day of the year with leading zeros (001 – 366)
ja: 1年のうち何日目かを表す日（先頭のゼロあり）（001～366）

source: Day of the year without leading zeros (1 – 366)
ja: 1年のうち何日目かを表す日（先頭のゼロなし）（1～366）

source: Dead keys are counted as producing text, although they do not typically produce an immediate effect.
ja: デッドキーは、通常、即効性はありませんが、テキストを生成するものとしてカウントされます。

source: Debugger Improvements
ja: デバッガの改良

source: Debugger improvements:
ja: デバッガの改善：

source: Debugging Clients
ja: クライアントのデバッグ

source: Debugging Clients | AutoHotkey v2
ja: クライアントのデバッグ｜AutoHotkey v2

source: Debugging a Script
ja: スクリプトのデバッグ

source: Debugging features include:
ja: デバッグ機能は以下の通りです：

source: Dec
ja: 十進法

source: Decimal floating-point numbers, such as 3.14159.
ja: 3.14159のような10進数の浮動小数点数。

source: Decimal integers, such as 123, 00123 or -1.
ja: 123、00123、-1などの10進数整数。

source: Declaration keywords and names of control flow statements are also reserved, primarily to detect mistakes.
ja: 宣言キーワードや制御フロー文の名前も、主に間違いを検出するために予約されています。

source: Declarations are generally not needed as much.
ja: 宣言は一般的にあまり必要ありません。

source: Declarations like static x.y := z are also supported, provided that x was previously defined in this class.
ja: static x.y := zのような宣言も、xが以前にこのクラスで定義されていればサポートされる。

source: Declarations like x.y := z are also supported, provided that x was previously defined in this class.
ja: x.y := zのような宣言も、xが以前にこのクラスで定義されていればサポートされる。

source: Declaring a variable with local no longer makes the function assume-global.
ja: 変数をlocalで宣言しても、その関数がassume-globalにならなくなりました。

source: Decreases the master volume by 10 percent.
ja: マスター音量を10パーセント下げます。

source: Decreases the master volume by 10 %.
ja: マスターの音量を10%下げる。

source: Decreasing the length truncates the array.
ja: 長さを小さくすると、配列は切り捨てられます。

source: Default Property
ja: デフォルトのプロパティ

source: Default Script
ja: デフォルトのスクリプト

source: Default Settings
ja: デフォルトの設定

source: Default Value
ja: デフォルトの値

source: Default Version
ja: デフォルト・バージョン

source: Default dimensions, in pixels, of a maximized top-level window on the primary display monitor.
ja: プライマリディスプレイモニタ上で最大化されたトップレベルウィンドウのデフォルト寸法（ピクセル単位）。

source: Default for X
ja: Xのデフォルト

source: Default for Y
ja: Yのデフォルト

source: Default is #1, or any ResourceID compiler directive in the script.
ja: デフォルトは#1、またはスクリプト中のResourceIDコンパイラディレクティブ。

source: Default is the directory\base_name of the input file plus extension of .exe, or any relevant compiler directive in the script.
ja: デフォルトは、入力ファイルのディレクトリベース名と拡張子.exe、またはスクリプト内の関連するコンパイラディレクティブである。

source: Default is the last .bin file name saved in the GUI interface.
ja: デフォルトは、GUIインターフェイスで最後に保存された.binファイル名です。

source: Default is the last base file name saved in the GUI interface, or any Base compiler directive in the script.
ja: デフォルトは、GUIインターフェイスで最後に保存されたベースファイル名、またはスクリプト内の任意のBaseコンパイラディレクティブです。

source: Default is the last icon saved in the GUI interface, or any SetMainIcon compiler directive in the script.
ja: デフォルトは、GUIインターフェイスに最後に保存されたアイコンか、スクリプトのSetMainIconコンパイラディレクティブです。

source: Default is the last setting saved in the GUI interface.
ja: デフォルトは、GUI インターフェースで最後に保存された設定です。

source: Default is the last setting used in the GUI interface.
ja: デフォルトは、GUI インターフェースで最後に使用された設定です。

source: Default maximum dimensions of a window that has a caption and sizing borders, in pixels.
ja: キャプションとサイズ調整枠を持つウィンドウのデフォルトの最大寸法、単位はピクセル。

source: Default to Create:
ja: デフォルトは作成：

source: Default to Create: Pressing Enter will activate the Create button, which creates the script and selects it in Explorer.
ja: Default to Create：Enterを押すとCreateボタンがアクティブになり、スクリプトが作成されてエクスプローラで選択されます。

source: Default to Edit:
ja: デフォルトはEdit：

source: Default to Edit: Pressing Enter will activate the Edit button, which creates the script and opens it in the default script editor.
ja: Default to Edit：Enterを押すとEditボタンが有効になり、スクリプトが作成されてデフォルトのスクリプトエディタで開きます。

source: Default width and height of an icon, in pixels.
ja: アイコンのデフォルトの幅と高さをピクセル単位で示す。

source: Default:
ja: 既定値：

source: Defaults are instead handled more dynamically by the launcher, and can be configured per-user.
ja: デフォルトはランチャーによってより動的に処理され、ユーザーごとに設定できる。

source: Defaults to 1 (true).
ja: デフォルトは1（true）です。

source: Defaults to matching a prefix of the tab name as before.
ja: デフォルトは、従来通りタブ名のプレフィックスと一致します。

source: Define a new property with the given value, such as by calling DefineProp.
ja: DefinePropを呼び出すなどして、指定された値を持つ新しいプロパティを定義する。

source: Define abbreviations that expand as you type them
ja: 入力すると展開される略語を定義します

source: Define an enumerator as a class.
ja: 列挙者をクラスとして定義します。

source: Define an enumerator as a fat arrow function.
ja: ファットアロー関数として列挙子を定義します。

source: Define the AltTabWindow window group as shown below before running this example.
ja: この例を実行する前に、AltTabWindowウィンドウグループを以下のように定義してください。

source: Defined properties and methods take precedence over meta-functions, regardless of whether they were defined in a base object.
ja: 定義されたプロパティやメソッドは、ベースオブジェクトで定義されたかどうかにかかわらず、メタファンクションよりも優先されます。

source: Defines a hotkey which toggles the tray to the opposite state (open or closed), based on the time the function takes to complete.
ja: 機能が完了するまでの時間に応じて、トレイを反対の状態（開または閉）に切り替えるホットキーを定義します。

source: Defines a new own property.
ja: 新しい自身のプロパティを定義する。

source: Defines a simple function and returns a Func or Closure object.
ja: 単純な関数を定義し、FuncまたはClosureオブジェクトを返します。

source: Defines an enumerator as a class.
ja: 列挙者をクラスとして定義します。

source: Defines an enumerator as a fat arrow function.
ja: ファットアロー関数として列挙子を定義します。

source: Defines the default value returned when a key is not found.
ja: キーが見つからない場合に返されるデフォルト値を定義します。

source: Defines the default value returned when an element with no value is requested.
ja: 値のない要素が要求されたときに返されるデフォルト値を定義します。

source: Delegation
ja: 代表

source: Delete (or Del)
ja: Delete（またはDel）

source: Delete does not affect the Length of the array.
ja: 削除は配列の長さには影響しません。

source: Delete method
ja: Deleteメソッド

source: Deletes Internet Explorer's history of URLs typed by the user.
ja: Internet Explorerのユーザーが入力したURLの履歴を削除します。

source: Deletes a callback and releases its reference to the function object.
ja: コールバックを削除し、関数オブジェクトへの参照を解放します。

source: Deletes a folder.
ja: フォルダーを削除します。

source: Deletes a key and its value located in section2 from a standard format .ini file.
ja: 標準形式の .ini ファイルから、section2 にあるキーとその値を削除します。

source: Deletes a menu item or all custom menu items.
ja: メニュー項目またはすべてのカスタムメニュー項目を削除します。

source: Deletes a menu item or all menu items.
ja: メニュー項目またはすべてのメニュー項目を削除します。

source: Deletes a subkey from the registry.
ja: レジストリからサブキーを削除します。

source: Deletes a value from a standard format .ini file.
ja: 標準形式の .ini ファイルから値を削除します。

source: Deletes a value from the registry.
ja: レジストリから値を削除します。

source: Deletes all .tmp files in a directory.
ja: ディレクトリ内のすべての .tmp ファイルを削除します。

source: Deletes one or more files permanently.
ja: ごみ箱に残さず、ファイルを削除します。

source: Deletes one or more files.
ja: 1つまたは複数のファイルを削除します。

source: Deletes the current item if it is a key.
ja: 現在のアイテムがキーの場合、削除します。

source: Deletes the current item if it is a value.
ja: 現在の項目が値である場合、それを削除します。

source: Deletes the specified ImageList.
ja: 指定された ImageList を削除します。

source: Deletes the specified column and all of the contents beneath it.
ja: 指定された列とその下にあるすべてのコンテンツを削除する。

source: Deletes the specified entry number from a ListBox or ComboBox.
ja: リストボックスまたはコンボボックスから指定されたエントリ番号を削除します。

source: Deletes the specified entry or all entries of a ListBox, DropDownList, ComboBox, or Tab control.
ja: ListBox、DropDownList、ComboBox、Tab コントロールの指定された項目またはすべての項目を削除します。

source: Deletes the specified item or all items.
ja: 指定された項目またはすべての項目を削除します。

source: Deletes the specified row or all rows.
ja: 指定された行またはすべての行を削除する。

source: Deletes the window.
ja: ウィンドウを削除します。

source: Deleting a wildcard pattern such as "*.tmp" is considered a success even if it does not match any files.
ja: "*.tmp"のようなワイルドカードパターンの削除は、どのファイルにもマッチしない場合でも成功したとみなされます。

source: Deleting from the registry is potentially dangerous - please exercise caution!
ja: レジストリからの削除は、危険な可能性がありますので、ご注意ください！

source: Delimiter characters are not considered to be part of the substrings themselves.
ja: デリミタ文字は、部分文字列自体の一部とはみなされません。

source: Demonstrate some techniques for wrapping COM interfaces.
ja: COMインタフェースをラッピングするいくつかのテクニックを実証します。

source: Demonstrates QueryPerformanceCounter(), which gives more precision than A_TickCount's 10ms.
ja: A_TickCountの10msより精度の高いQueryPerformanceCounter()のデモを行います。

source: Demonstrates QueryPerformanceCounter(), which gives more precision than A_TickCount's 10 ms.
ja: A_TickCountの10 msより精度の高いQueryPerformanceCounter()のデモを行います。

source: Demonstrates a range check.
ja: レンジチェックを実演。

source: Demonstrates asynchronous debugging.
ja: 非同期デバッグのデモを行います。

source: Demonstrates basic error handling of built-in functions.
ja: 組込み関数の基本的なエラー処理を示す。

source: Demonstrates comparison with pre-release versions.
ja: プレリリース版との比較を示す。

source: Demonstrates custom sorting via a callback function.
ja: コールバック関数によるカスタム・ソートのデモンストレーション。

source: Demonstrates different styles of how the Else statement can be used too.
ja: Elseステートメントもどのように使うことができるのか、さまざまなスタイルを実演しています。

source: Demonstrates different usages.
ja: さまざまな使い方を実演します。

source: Demonstrates how to add icons to menu items.
ja: メニュー項目にアイコンを追加する方法を説明します。
